Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/iLLD_39A/Tricore/Dma/Dma/IfxDma_Dma.h
#ifndef IFXDMA_DMA_H
#define IFXDMA_DMA_H 1

/******************************************************************************/
/*----------------------------------Includes----------------------------------*/
/******************************************************************************/

#include "_Impl/IfxDma_cfg.h"
#include "Dma/Std/IfxDma.h"
#include "Cpu/Std/IfxCpu.h"

/******************************************************************************/
/*-----------------------------Data Structures--------------------------------*/
/******************************************************************************/

/** \addtogroup IfxLld_Dma_Dma_Data_Structures
 * \{ */
/** \brief DMA base address data structure (Module handle)
 */
typedef struct
{
    Ifx_DMA *dma;       /**< \brief Specifies the pointer to the DMA registers */
} IfxDma_Dma;

/** \} */

/** \addtogroup IfxLld_Dma_Dma_Data_Structures
 * \{ */
/** \brief Channel handle
 */
typedef struct
{
    Ifx_DMA         *dma;             /**< \brief Specifies the pointer to the DMA registers */
    IfxDma_ChannelId channelId;       /**< \brief Specifies the DMA channel */
    Ifx_DMA_CH      *channel;         /**< \brief Specifies the pointer to DMA channel registers */
} IfxDma_Dma_Channel;

/** \brief Configuration data structure of the channel
 */
typedef struct
{
    IfxDma_Dma                      *module;                                       /**< \brief Specifies pointer to the IfxDma_Dma module handle */
    IfxDma_ChannelId                 channelId;                                    /**< \brief Specifies the channel being used */
    uint32                           sourceAddress;                                /**< \brief Source address for the DMA channel */
    uint32                           destinationAddress;                           /**< \brief Destination address for the DMA channel */
    uint32                           shadowAddress;                                /**< \brief Initial content of shadow address for the DMA channel */
    uint32                           readDataCrc;                                  /**< \brief Checksum for read data of the channel */
    uint32                           sourceDestinationAddressCrc;                  /**< \brief Checksum for source and destination address of channel */
    uint16                           transferCount;                                /**< \brief Number of transfers in a transaction */
    IfxDma_ChannelMove               blockMode;                                    /**< \brief Number of moves in a transfer */
    IfxDma_ChannelRequestMode        requestMode;                                  /**< \brief A service request initiates a single transfer, or the complete transaction */
    IfxDma_ChannelOperationMode      operationMode;                                /**< \brief keep enable/disable the hardware channel request after a transaction */
    IfxDma_ChannelMoveSize           moveSize;                                     /**< \brief Read/write data size */
    IfxDma_ChannelPattern            pattern;                                      /**< \brief Pattern selection operation modes */
    IfxDma_ChannelRequestSource      requestSource;                                /**< \brief Request of channel transfer through hardware or daisy chain. channel transfer complete interrupt of previous channel will trigger the next channel request */
    IfxDma_ChannelBusPriority        busPriority;                                  /**< \brief Bus priority selection */
    boolean                          hardwareRequestEnabled;                       /**< \brief Enabling channel transaction via hardware request */
    IfxDma_ChannelIncrementStep      sourceAddressIncrementStep;                   /**< \brief Describes the address offset with which the source address should be modified after each move */
    IfxDma_ChannelIncrementDirection sourceAddressIncrementDirection;              /**< \brief Decides whether the source address offset after each move should be added or decremented from the exisiting address */
    IfxDma_ChannelIncrementCircular  sourceAddressCircularRange;                   /**< \brief Determines which part of the source address remains unchanged and therby not updated after each move */
    IfxDma_ChannelIncrementStep      destinationAddressIncrementStep;              /**< \brief Describes the address offset with which the destination address should be modified after each move */
    IfxDma_ChannelIncrementDirection destinationAddressIncrementDirection;         /**< \brief Decides whether the destination address offset after each move should be added or decremented from the exisiting address */
    IfxDma_ChannelIncrementCircular  destinationAddressCircularRange;              /**< \brief Determines which part of the destination address remains unchanged and therby not updated after each move */
    IfxDma_ChannelShadow             shadowControl;                                /**< \brief selects the shadow transfer mode */
    boolean                          sourceCircularBufferEnabled;                  /**< \brief Enables/Disables the source circular buffering */
    boolean                          destinationCircularBufferEnabled;             /**< \brief Enables/Disables the destination circular buffering */
    boolean                          timestampEnabled;                             /**< \brief Enables/Disables the appendage of the time stamp after end of the last DMA move in a transaction */
    boolean                          wrapSourceInterruptEnabled;                   /**< \brief An interrupt should be triggered whenever source address is wrapped */
    boolean                          wrapDestinationInterruptEnabled;              /**< \brief An interrupt should be triggered whenever destination address is wrapped */
    boolean                          channelInterruptEnabled;                      /**< \brief The channel transfer interrupt should be triggered. See also channelInterruptControl */
    IfxDma_ChannelInterruptControl   channelInterruptControl;                      /**< \brief The channel transfer interrupt can either be triggered depending on the interruptRaiseThreshold, or each time the transaction count is decremented */
    uint8                            interruptRaiseThreshold;                      /**< \brief The value of the transferCount at which the interrupt should be raised */
    boolean                          transactionRequestLostInterruptEnabled;       /**< \brief Enables/Disables the channel transaction request lost interrupt */
    Ifx_Priority                     channelInterruptPriority;                     /**< \brief Priority of the channel interrupt trigger */
    IfxSrc_Tos                       channelInterruptTypeOfService;                /**< \brief Interrupt service provider */
} IfxDma_Dma_ChannelConfig;

/** \brief Configuration data structure of the Module
 */
typedef struct
{
    Ifx_DMA *dma;       /**< \brief Specifies the pointer to the DMA registers */
} IfxDma_Dma_Config;

